Revit 2027 API
DetailElementOrderUtils.BringToFront(Document, View, ICollection<ElementId>) Method
 Places the given detail instances in the front of all other detail instances in the view, while keeping the order of the given ones.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static void BringToFront(
	Document document,
	View view,
	ICollection<ElementId> detailElementIds
)
Public Shared Sub BringToFront (
	document As Document,
	view As View,
	detailElementIds As ICollection(Of ElementId)
)
public:
static void BringToFront(
	Document^ document,
	View^ view,
	ICollection<ElementId^>^ detailElementIds
)
static member BringToFront :
        document : Document *
        view : View *
        detailElementIds : ICollection<ElementId> -> unit
Parameters
document Document
 The document.
view View
 The view in which the details appear.
detailElementIds ICollection<ElementId>
 The details to bring to front.
Exceptions
Exception | Condition
ArgumentException |  The document does not support detail draw order. Only projects and 3d families support draw order. 2d families and in-place families do not support draw order. -or- detailElementIds is empty or it contains elements that do not participate in detail draw ordering. Details must be visible in the view. -or- In 3d families, detail draw order can only be adjusted in views that are parallel to the document's X, Y or Z axes.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
DetailElementOrderUtils Class
BringToFront Overload
Autodesk.Revit.DB Namespace